Revit 2026 API

# ViewportGetBoxOutline Method

---

Returns the outline of the viewport on the sheet, excluding the viewport label.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Outline GetBoxOutline()
```
```vb
Public Function GetBoxOutline As Outline
```
```cpp
public:
Outline^ GetBoxOutline()
```
```fsharp
member GetBoxOutline : unit -> Outline
```

#### Return Value

Outline The outline of the viewport on the sheet.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The viewport is not on a sheet. |

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace